STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_SerialCom_Peripheral/STM32_WPAN/App/app_ble.c
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

static void Adv_Request(APP_BLE_ConnStatus_t NewStatus)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  bleAppContext.Device_Connection_Status = NewStatus;

  /* Start Fast or Low Power Advertising */
  ret = aci_gap_set_discoverable(ADV_TYPE,
                                 ADV_INTERVAL_MIN,
                                 ADV_INTERVAL_MAX,
                                 CFG_BD_ADDRESS_TYPE,
                                 ADV_FILTER,
                                 0,
                                 0,
                                 0,
                                 0,
                                 0,
                                 0);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> aci_gap_set_discoverable - fail, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("==>> aci_gap_set_discoverable - Success\n");
  }

  ret = aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("==>> delete tx power level - fail\n");
  }

  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_AdvData), (uint8_t*) a_AdvData);
  if (ret != BLE_STATUS_SUCCESS)
  {
      LOG_INFO_APP("==>> Start Fast Advertising Failed , result: 0x%02X\n", ret);
  }
  else
  {
      LOG_INFO_APP("==>> Success: Start Fast Advertising\n");
  }
  BleStackCB_Process();
  return;
}

void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle, uint16_t conn1, uint16_t conn2)
{
  tBleStatus ret;

  ret = aci_l2cap_connection_parameter_update_req(ConnectionHandle,
                                                  conn1, conn2,
                                                  0, 0x3E8);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("BLE_SVC_L2CAP_Conn_Update(), Failed: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("BLE_SVC_L2CAP_Conn_Update(), Successfully\n");
  }

  BleStackCB_Process();
  return;
}
static void Connection_Interval_Update_Req(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(bleAppContext.connectionHandle,
                              CONN_INT_MS(45), CONN_INT_MS(45));
  }
  BleStackCB_Process();
  return;
}

static void Periph_security_request(void)
{
  tBleStatus status;
  status = aci_gap_slave_security_req(bleAppContext.connectionHandle);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Periph security request cmd failure: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("Periph security request cmd success\n");
  }
  BleStackCB_Process();
}

void APP_BSP_Button1Action(void)
{
  if (real_time == 0)
  {
    real_time = 1;
    LOG_INFO_APP("Real time mode\n");
  }
  else
  {
    real_time = 0;
    LOG_INFO_APP("Send data mode \n");
  }
  return;
}

void APP_BSP_Button2Action(void)
{
  tBleStatus status;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    status = aci_gap_clear_security_db();
    if (status != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Clear security DB cmd failure: 0x%02X\n", status);
    }
    else
    {
      LOG_INFO_APP("Clear security DB cmd success\n");
    }
  }
  else
  {
    LOG_INFO_APP("**PERIPH SECURITY REQ \n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_PERIPH_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }
  return;
}

/* USER CODE END FD_WRAP_FUNCTIONS */
